; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	image1 - mode
	spectrograph5 - mode
	thermograph8 - mode
	spectrograph0 - mode
	thermograph7 - mode
	image2 - mode
	image6 - mode
	image3 - mode
	image4 - mode
	Star1 - direction
	GroundStation2 - direction
	GroundStation3 - direction
	GroundStation4 - direction
	Star0 - direction
	Star5 - direction
	Planet6 - direction
	Planet7 - direction
	Phenomenon8 - direction
	Phenomenon9 - direction
	Star10 - direction
)
(:init
	(supports instrument0 image3)
	(supports instrument0 spectrograph0)
	(supports instrument0 spectrograph5)
	(calibration_target instrument0 Star0)
	(supports instrument1 image4)
	(supports instrument1 spectrograph0)
	(supports instrument1 image2)
	(supports instrument1 image6)
	(supports instrument1 thermograph7)
	(supports instrument1 thermograph8)
	(supports instrument1 image1)
	(calibration_target instrument1 Star5)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet7)
)
(:goal (and
	(have_image Planet6 thermograph7)
	(have_image Planet6 spectrograph0)
	(have_image Planet6 image6)
	(have_image Planet7 image3)
	(have_image Planet7 image6)
	(have_image Planet7 thermograph8)
	(have_image Phenomenon8 image6)
	(have_image Phenomenon8 image3)
	(have_image Phenomenon9 spectrograph0)
	(have_image Star10 image2)
	(have_image Star10 thermograph8)
	(have_image Star10 image6)
))

)

; plan
1. (turn_to satellite0 star5 planet7)
   deleted: (pointing satellite0 planet7)
   added: (pointing satellite0 star5)
   goals met: 0 of 12
2. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 0 of 12
3. (calibrate satellite0 instrument1 star5)
   added: (calibrated instrument1)
   goals met: 0 of 12
4. (turn_to satellite0 star10 star5)
   deleted: (pointing satellite0 star5)
   added: (pointing satellite0 star10)
   goals met: 0 of 12
5. (take_image satellite0 star10 instrument1 thermograph8)
   added: (have_image star10 thermograph8)
   goals met: 1 of 12
6. (take_image satellite0 star10 instrument1 image6)
   added: (have_image star10 image6)
   goals met: 2 of 12
7. (take_image satellite0 star10 instrument1 image2)
   added: (have_image star10 image2)
   goals met: 3 of 12
8. (turn_to satellite0 planet6 star10)
   deleted: (pointing satellite0 star10)
   added: (pointing satellite0 planet6)
   goals met: 3 of 12
9. (take_image satellite0 planet6 instrument1 thermograph7)
   added: (have_image planet6 thermograph7)
   goals met: 4 of 12
10. (take_image satellite0 planet6 instrument1 spectrograph0)
   added: (have_image planet6 spectrograph0)
   goals met: 5 of 12
11. (take_image satellite0 planet6 instrument1 image6)
   added: (have_image planet6 image6)
   goals met: 6 of 12
12. (turn_to satellite0 phenomenon9 planet6)
   deleted: (pointing satellite0 planet6)
   added: (pointing satellite0 phenomenon9)
   goals met: 6 of 12
13. (take_image satellite0 phenomenon9 instrument1 spectrograph0)
   added: (have_image phenomenon9 spectrograph0)
   goals met: 7 of 12
14. (turn_to satellite0 phenomenon8 phenomenon9)
   deleted: (pointing satellite0 phenomenon9)
   added: (pointing satellite0 phenomenon8)
   goals met: 7 of 12
15. (take_image satellite0 phenomenon8 instrument1 image6)
   added: (have_image phenomenon8 image6)
   goals met: 8 of 12
16. (turn_to satellite0 planet7 phenomenon8)
   deleted: (pointing satellite0 phenomenon8)
   added: (pointing satellite0 planet7)
   goals met: 8 of 12
17. (take_image satellite0 planet7 instrument1 image6)
   added: (have_image planet7 image6)
   goals met: 9 of 12
18. (take_image satellite0 planet7 instrument1 thermograph8)
   added: (have_image planet7 thermograph8)
   goals met: 10 of 12
19. (switch_off instrument1 satellite0)
   deleted: (power_on instrument1)
   added: (power_avail satellite0)
   goals met: 10 of 12
20. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 10 of 12
21. (turn_to satellite0 star0 planet7)
   deleted: (pointing satellite0 planet7)
   added: (pointing satellite0 star0)
   goals met: 10 of 12
22. (calibrate satellite0 instrument0 star0)
   added: (calibrated instrument0)
   goals met: 10 of 12
23. (turn_to satellite0 phenomenon8 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 phenomenon8)
   goals met: 10 of 12
24. (take_image satellite0 phenomenon8 instrument0 image3)
   added: (have_image phenomenon8 image3)
   goals met: 11 of 12
25. (turn_to satellite0 planet7 phenomenon8)
   deleted: (pointing satellite0 phenomenon8)
   added: (pointing satellite0 planet7)
   goals met: 11 of 12
26. (take_image satellite0 planet7 instrument0 image3)
   added: (have_image planet7 image3)
   goals met: 12 of 12
